wedge/1/pr2.2/0/T
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     4.0                                |
|   \  /    A nd           | Web:         http://www.foam-extend.org         |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 300;

    }
    topwall
    {
        type            fixedValue;
        value           uniform 300;


    }
    
    outlet
    {
        type            waveTransmissive;
        psi             thermo:psi;
        gamma           1.4;
	fieldInf	300;
        value           uniform 300;


    }
    
    plate
    {
        type            waveTransmissive;
        psi             thermo:psi;
        gamma           1.4;
	fieldInf	300;
        value           uniform 300;


    }
    wall1
    {
        type            wedge;
    }
    wall2
    {
        type            wedge;
    }

}


// ************************************************************************* //
